# написати програму, яка просить в користувача ввести через пробіл міста, в яких він був за минулі 10 років
# потім окремо запросити у користувача міста, куди він хоче поїхати внаступні 10 років
# вивести на екран повідомлення з текстом про те, що користувачу, мабуть, дуже сподобалося в містах, які він повторив в
# двох циклах вводу, а саме... (сформувати строку, використовуючи join)
# якщо повтору не було - вивести повідомлення, що користувач відкритий до чогось нового
# врахувати випадки, що користувач нічого не вводить не потрібно, в даному випадку вам явно зазначено,
# що ці перевірки не потрібні.
# не потрібно перевіряти введення цифр
# ми виходим із того, що користувач введе щось на зразок "Київ Тернопіль париЖ акапулько-80"
# В той же час врахуйте, що користувач може вводити дані в різних регістрах
#
# використати сети!!!


input_1=input('Ввдіть через пробіл міста>>>>>')
set_1=set([input_1])

input_2=input('В які міста ви хочете поїхати наступні 10 років>>>>>')
set_2=set([input_2])
print(set_2)
# united_set="'"+(",".join(set_1)+"'"+ " "+"'"+ ",".join(set_2))+"'"
# print(united_set)
output_set=set_1 & set_2
print(output_set)
if output_set==0:
    print('Можливо ви готові до чогось нового?')
else:
    print('Мабуть Вам дуже сподобалося у містах -' + "'" + ",".join(output_set) + "'")